 # Połączenie z bazą danych przy pomocy sqlAlchemy

In [145]:
import sqlalchemy
from sqlalchemy import create_engine
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

Zapytanie do bazy i wypisanie wyników

In [146]:
#result_set = db.execute("SELECT * FROM city")  
#for r in result_set:  
#    print(r)

 # Połączenie z bazą danych przy pomocy psycopg2 i pandas

In [147]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

Zapytanie do bazy i wypisanie wyników

In [148]:
#df = pd.read_sql('select * from city',con=connection)
#df

## Połączenie za pomocą sqlAlchemy i pandas

In [149]:
df = pd.read_sql('select * from city', con=connection_sqlalchemy)
df

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

Zadanie 1

In [150]:
df = pd.read_sql('select category_id from film_category', con=connection_sqlalchemy)
liczba_kategorii = df.max()

print("Liczba kategorii filmów w wypożyczalni wynosi: ",*liczba_kategorii)

Liczba kategorii filmów w wypożyczalni wynosi:  16

Zadanie 2

In [151]:
df = pd.read_sql('select name from category', con=connection_sqlalchemy)
df

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

Zadanie 3

In [152]:
df = pd.read_sql('select * from film', con=connection_sqlalchemy)
najmlodszy = df.loc[df['release_year'].idxmax()]
najstarszy = df.loc[df['release_year'].idxmin()]

print("Najstarszy film jest z roku:", najstarszy[3],"i nazywa się:",najstarszy[1])
print("Najmłodszy film jest z roku:", najmlodszy[3],"i nazywa się:",najmlodszy[1])

Najstarszy film jest z roku: 2006 i nazywa się: Chamber Italian
Najmłodszy film jest z roku: 2006 i nazywa się: Chamber Italian

Zadanie 4

In [153]:
df = pd.read_sql("select rental_date from rental WHERE rental_date BETWEEN '2005-07-01' and '2005-08-01'", con=connection_sqlalchemy)
liczba_wypozyczen = df.shape[0]
print("Pomiędzy 2005-07-01 a 2005-08-01 filmy w wypożyczalni wypożyczono",liczba_wypozyczen,"razy")

Pomiędzy 2005-07-01 a 2005-08-01 filmy w wypożyczalni wypożyczono 6709 razy

Zadanie 5

In [154]:
df = pd.read_sql("select rental_date from rental WHERE rental_date BETWEEN '2010-01-01' and '2011-02-01'", con=connection_sqlalchemy)
liczba_wypozyczen = df.shape[0]
print("Pomiędzy 2010-01-01 a 2011-02-01 filmy w wypożyczalni wypożyczono",liczba_wypozyczen,"razy")

Pomiędzy 2010-01-01 a 2011-02-01 filmy w wypożyczalni wypożyczono 0 razy

Zadanie 6

In [155]:
df = pd.read_sql("select amount from payment", con=connection_sqlalchemy)
najwieksza_platnosc = df.loc[df['amount'].idxmax()]
print("Największa płatność wynosiła: ",*najwieksza_platnosc)

Największa płatność wynosiła:  11.99

Zadanie 7

In [158]:
kraj = pd.read_sql("select country_id from country where country = 'Poland' or country = 'Bangladesh' or country = 'Nigeria'", con=connection_sqlalchemy)
kraj_lista = kraj.country_id.tolist()

miasto = pd.read_sql("select * from city ",con=connection_sqlalchemy)
miasto_id = miasto[miasto['country_id'].isin(kraj_lista)]
miasto_lista = miasto_id.city_id.tolist()

adres = pd.read_sql("select * from address",con=connection_sqlalchemy)
adres_id = adres[adres['city_id'].isin((miasto_lista))]
adres_lista = adres_id.address_id.tolist()

dane_osobowe = pd.read_sql("select first_name,last_name,address_id from customer",con=connection_sqlalchemy)
dane_osobowe_id = dane_osobowe[dane_osobowe['address_id'].isin(adres_lista)]
dane_osobowe_lista = dane_osobowe_id.loc[:, ['first_name','last_name']]
dane_osobowe_lista

    first_name  last_name
18       Carol     Garcia
21    Michelle      Clark
80     Marilyn       Ross
103     Gladys   Hamilton
128   Marjorie     Tucker
156     Bertha   Ferguson
198      Elsie     Kelley
232  Constance       Reid
250         Jo     Fowler
270       Leah     Curtis
277       Olga    Jimenez
280     Tracey    Barrett
284      Sonia    Gregory
286      Velma      Lucas
318      Brian      Wyman
329      Frank   Waggoner
332    Stephen     Qualls
380    Russell    Brinson
409     Rodney    Moeller
501      Ruben      Geary
557     Jimmie  Eggleston
561    Wallace      Slone
570    Johnnie   Chisholm
571     Sidney   Burleson

Zadanie 8

In [240]:
dane =pd.read_sql("select * from staff",con=connection_sqlalchemy)
personel_adres_lista = dane.address_id.tolist()
dane_id = dane[dane['address_id'].isin(personel_adres_lista)]

personel_miasto = pd.read_sql("select * from address",con=connection_sqlalchemy)
personel_miasto_id = personel_miasto[personel_miasto['address_id'].isin(personel_adres_lista)]
personel_miasto_lista = personel_miasto_id.city_id.tolist()

personel_kraj = pd.read_sql("select * from city",con=connection_sqlalchemy)
personel_kraj_id = personel_kraj[personel_kraj['city_id'].isin(personel_miasto_lista)]
personel_kraj_lista = personel_kraj_id.country_id.tolist()

personel_dane_osobowe = pd.read_sql("select * from country",con=connection_sqlalchemy)
personel_dane_osobowe_id = personel_dane_osobowe[personel_dane_osobowe['country_id'].isin(personel_kraj_lista)]

dane_wynik = dane_id.loc[:,['first_name','last_name']].reset_index(drop=True)
adres_wynik = personel_miasto_id.loc[:,['address']].reset_index(drop=True)
kraj_wynik = personel_dane_osobowe_id.loc[:,['country']].reset_index(drop=True)
wynik = pd.concat([dane_wynik,adres_wynik,kraj_wynik],axis=1)
wynik

  first_name last_name               address    country
0       Mike   Hillyer     23 Workhaven Lane  Australia
1        Jon  Stephens  1411 Lillydale Drive     Canada

Zadanie 9

Odpowiedż do zadania 9 zawiera się w rozwiązaniu do zadania 8. Żaden z pracowników nie mieszka w Argentynie lub Hiszpanii.

Zadanie 10